const mongoose = require('mongoose')

const QuestionSchema = new mongoose.Schema({
   //ex1:وعي صوتي ex2:جانب صرفي ex3: قراءة الكلمات ex4: كتابة
    exam: {
        type: String,
        default: 'الوعي الصوتي',
        enum: ['الوعي الصوتي', 'الجانب الصرفي', 'قراءة الكلمات', 'كتابة'],
    },
   
    //s1,s2,s3,s4,s5,s6,s7,s8,s9,s10,s11,s12,s13,s14
    //، حذف', 'دمج', 'فصل', 'ذاكرة'،تسمية سريعة،،تعرف الوحدات الصرفية،اشتقاق الكلمات من الجذر، قراءة كلمات غير مرتبطة بوقت، قراءة كلمات غير حقيقية، الطلاقة في القراءة، تحديد اسم او صوت الحرف الحرف المظلل، تمييز الكلمات المتشابهة كتابيا، سرعة تعرف الحروف والمقاطع
    section: {
        type: String,
        enum: ['حذف','دمج','فصل','تقطيع','ذاكرة رقمية','تسمية سريعة','تعرف الوحدات الصرفية','اشتقاق الكلمات من الجذر','قراءة كلمات غير مرتبطة بوقت','قراءة كلمات غير حقيقية','الطلاقة في القراءة','تحديد اسم او صوت الحرف المظلل','تمييز الكلمات المتشابهة كتابيا','سرعة تعرف الحروف والمقاطع'],
    },
   questionNumber: {
        type: Number,
        //required: true,
    },

    instructions: {
        type: String,  
        
    },
    title: {
        type: String,  
        
    },

    type: {
        type: String, 
        default: 'النوع الاول',
        enum: ['النوع الاول', 'النوع الثاني','النوع الثالث','النوع الرابع','النوع الخامس'],
    },
    maxScore:{
        default:0,
        type: Number,
    },
    
})

module.exports = mongoose.model('Question', QuestionSchema)
